content/blog/webmaster_project/Regular Expressions Tutorial.org
#+setupfile: ../../../.org-templates/level/1.org
#+title: Regular Expressions Tutorial
#+description: In this tutorial, I'll walk you through the most practical aspects of regular expressions and their use in JavaScript.
* Introduction
A Regular Expression (I'll often call it a regex for short) is a sequence of characters that define a search pattern. It provides you with the syntax to very specifically match characters in a given string. And, it makes you look cool on [[https://www.codewars.com/users/thewebmasterp][Codewars]] with those one-liner solutions 😃.

Let's get our hands dirty right away with an example!
#+begin_src js -n
  const regex = /[A-Z]\w+/g;
#+end_src
+ ~/.../g~ - Just like the content of an array literal is enclosed between ~[]~, a regular expression literal consists of a pattern enclosed between slashes ~//~. ~g~ is called a flag, more on that later.
+ ~[A-Z]~ - Matches uppercase letters from A to Z
+ ~\w~ is a shorthand for ~[A-Za-z0-9_]~ (uppercase letters from A to Z, lowercase letters from a to z, numerals from 0 to 9, underscore)
+ ~+~ One or more instances of the preceding element (~\w~)
#+begin_src js -n
  const str = 'Nikola, Georgi and Viktoria are all coders who live in Bulgaria'

  console.log( str.match(regex) )
  // => [ "Nikola", "Georgi", "Viktoria", "Bulgaria" ]
#+end_src
This operation can be performed using vanilla JavaScript but regular expressions are the better tool for that. You don't use a hammer to fasten some papers with a staple, do you?
* Creating Regular Expressions
A regular expression can be created using a literal:
#+begin_src js -n
  const regex = /[A-Z]\w+/g;
  // The content between /.../ is the actual regex.
  // The letter after the last slash is called a flag.
  // You can have multiple flags.
#+end_src
Or by calling the constructor function of the RegExp object:
#+begin_src js -n
  const regex = new RegExp('[A-Z]\w+', 'g');
  // First parameter is the actual regex, in a string.
  // Second parameter is a string containing flags.
#+end_src
Most of the time, you'd prefer using the literal expression as it is as well as with arrays  - you prefer ~[1, 2]~, rather than ~Array(1, 2)~. The constructor way of initializing a regular expression is useful when you want to pass the regex as a string, which is powerful. Your program can generate the string based on its state and on top of regex's power, this makes you invincible ⚡. Let's keep on rocking!
* The very basics
Let's try to match the word "apple". ~/apple/~ would do the job. It, however, won't match "APPLE" or "aPpLe", because regex is case sensitive.

To disable case sensitivity in regex use what's called an ~i~ flag, like this ~/apple/i~. Now it will match "apple", "APPLE" & "aPpLe"

If you want to match two words in a single regex, use ~/apple|nut/~.
** Usage in JavaScript
Take this as an introduction to the most basic methods in JS for working with regexes.
*** str.match(regex)
returns an array with all the matches. However, there's a little catch here. If you try doing this:
#+begin_src js -n
  "apple apple".match(/apple/)
#+end_src
you'd probably expect to get ~[ 'apple', 'apple' ]~ but that's not the case. Without its ~g~ flag, regex won't match multiple occurrences. So in that case, ~/apple/~ matches just the first occurrence of the substring "apple" and ~/apple/g~ matches all of the occurrences. 
*** regex.test(str)
Think of ~regex~ as a variable holding a RegExp object and ~str~ is the string you test against ~regex~. The method returns a boolean indicating whether it matched or not.

Let's play with all we've just learned:
#+begin_src js -n
  let regex = /code|easy/i
  const str = "this code is EaSy super easy"
  regex.test(str) // => true; we've got a match!

  str.match(regex) // => [ "code", index: 5, input... ]

  // Oops! We forgot adding the g flag
  regex = /code|easy/ig

  str.match(regex) // => [ "code", "EaSy", "easy" ]
  // Alright!
#+end_src
