public/blog/webmaster_project/Regular Expressions Tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-20 Wed 17:17 -->
<meta charset="utf-8" />
<title>Regular Expressions Tutorial</title>
<meta name="author" content="thewebmasterp" />
<meta name="description" content="
In this tutorial, I'll walk you through the most practical aspects of regular expressions and their use in JavaScript." />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, target-densityDpi=device-dpi, user-scalable=no, maximum-scale=0.8">
<link rel="stylesheet" href="../../css/style.min.css" />
<link rel="apple-touch-icon" sizes="180x180" href="../../img/meta/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="../../img/meta/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="../../img/meta/favicon-16x16.png">
<link rel="manifest" href="../../site.webmanifest">
</head>
<body>
<div id="preamble" class="status">
<div id='mask'> <div class='lds-ellipsis'><div></div><div></div><div></div><div></div></div> </div>
<script>0</script>
<nav id='topnav'>
<a class='homeLink' href='/index.html' title='The index, landing page of this website'>Home</a>
<a class='blogLink' href='/blog.html' title='My articles'>Blog</a>
<a class='aboutLink' href='/about.html' title='About the website and its owner'>About</a>
<div class='sparse'>
<div class='theme-changer'></div>
</div>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Regular Expressions Tutorial</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf4d0790">Introduction</a></li>
<li><a href="#org187c2fc">Creating Regular Expressions</a></li>
<li><a href="#orgd1db7cd">The very basics</a>
<ul>
<li><a href="#orgb7499a5">Usage in JavaScript</a>
<ul>
<li><a href="#org8b62591">str.match(regex)</a></li>
<li><a href="#org861268f">regex.test(str)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgca900ff">Flags</a></li>
<li><a href="#orgcbde880">Match anything with wildcard period</a></li>
<li><a href="#orgc0b8f52">Match a single character with multiple possibilities</a>
<ul>
<li><a href="#org554e59f">More complex cases</a></li>
<li><a href="#org85cc0b6">Common shorthands</a></li>
<li><a href="#org33593d6">Reverse the character classes</a></li>
</ul>
</li>
<li><a href="#orgbc858de">Match characters that occur one or more times</a></li>
<li><a href="#org4f37b47">Look for patterns from the beginning or from the end of string</a></li>
<li><a href="#orgef26054">Optional Character</a></li>
<li><a href="#org26a2b62">Specify upper and lower limit of matches</a></li>
<li><a href="#orgc8ca0dd">Match characters that occur multiple times</a>
<ul>
<li><a href="#org4b5dd5d">Match <b>one or more</b> characters</a></li>
<li><a href="#org856c378">Match <b>zero or more</b> characters</a></li>
<li><a href="#org3eda6fa">Match <b>zero or one</b> character</a></li>
</ul>
</li>
<li><a href="#orgfac878d">Positive and negative lookahead</a></li>
<li><a href="#orgd969263">Reusing patterns with <b>Capture Groups</b></a>
<ul>
<li><a href="#org5f187bf">First example</a></li>
<li><a href="#org619bb14">Second example</a></li>
<li><a href="#orgfa4837c">Third example</a></li>
</ul>
</li>
<li><a href="#org4700741">All 8 JavaScript methods which use regex</a>
<ul>
<li><a href="#org0408a27"><b>str</b>.match(<b>regex</b>)</a></li>
<li><a href="#orgce0ddbd"><b>regex</b>.exec(<b>str</b>)</a></li>
<li><a href="#org19cc1ce"><b>str</b>.matchAll(<b>regex</b>)</a></li>
<li><a href="#orge530817"><b>regex</b>.test(<b>str</b>)</a></li>
<li><a href="#org113fffc"><b>str</b>.search(<b>regex</b>)</a></li>
<li><a href="#orgb6720b6"><b>str</b>.split(<b>separator</b>)</a></li>
<li><a href="#org837942c"><b>str</b>.replace(<b>from</b>, to)</a></li>
<li><a href="#orgdbefc3d"><b>str</b>.replaceAll(<b>from</b>, to)</a></li>
</ul>
</li>
<li><a href="#org60bebc5">Closing words</a>
<ul>
<li><a href="#contributors_table">Contributors</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgf4d0790" class="outline-2">
<h2 id="orgf4d0790">Introduction</h2>
<div class="outline-text-2" id="text-orgf4d0790">
<p>
A Regular Expression (I'll often call it a regex for short) is a sequence of characters that define a search pattern. It provides you with the syntax to very specifically match characters in a given string. And, it makes you look cool on <a href="https://www.codewars.com/users/thewebmasterp">Codewars</a> with those one-liner solutions 😃.
</p>

<p>
Let's get our hands dirty right away with an example!
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/[A-Z]\w+/</span>g;
</pre>
</div>
<ul class="org-ul">
<li><code>/.../g</code> - Just like the content of an array literal is enclosed between <code>[]</code>, a regular expression literal consists of a pattern enclosed between slashes <code>//</code>. <code>g</code> is called a flag, more on that later.</li>
<li><code>[A-Z]</code> - Matches uppercase letters from A to Z</li>
<li><code>\w</code> is a shorthand for <code>[A-Za-z0-9_]</code> (uppercase letters from A to Z, lowercase letters from a to z, numerals from 0 to 9, underscore)</li>
<li><code>+</code> One or more instances of the preceding element (<code>\w</code>)</li>
</ul>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">'Nikola, Georgi and Viktoria are all coders who live in Bulgaria'</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>  console.log( str.match(regex) )
<span class="linenr">4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "Nikola", "Georgi", "Viktoria", "Bulgaria" ]</span>
</pre>
</div>
<p>
This operation can be performed using vanilla JavaScript but regular expressions are the better tool for that. You don't use a hammer to fasten some papers with a staple, do you?
</p>
</div>
</div>
<div id="outline-container-org187c2fc" class="outline-2">
<h2 id="org187c2fc">Creating Regular Expressions</h2>
<div class="outline-text-2" id="text-org187c2fc">
<p>
A regular expression can be created using a literal:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/[A-Z]\w+/</span>g;
<span class="linenr">2: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">The content between /.../ is the actual regex.</span>
<span class="linenr">3: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">The letter after the last slash is called a flag.</span>
<span class="linenr">4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">You can have multiple flags.</span>
</pre>
</div>
<p>
Or by calling the constructor function of the RegExp object:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-keyword">new</span> <span class="org-type">RegExp</span>(<span class="org-string">'[A-Z]\w+'</span>, <span class="org-string">'g'</span>);
<span class="linenr">2: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">First parameter is the actual regex, in a string.</span>
<span class="linenr">3: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Second parameter is a string containing flags.</span>
</pre>
</div>
<p>
Most of the time, you'd prefer using the literal expression as it is as well as with arrays  - you prefer <code>[1, 2]</code>, rather than <code>Array(1, 2)</code>. The constructor way of initializing a regular expression is useful when you want to pass the regex as a string, which is powerful. Your program can generate the string based on its state and on top of regex's power, this makes you invincible ⚡. Let's keep on rocking!
</p>
</div>
</div>
<div id="outline-container-orgd1db7cd" class="outline-2">
<h2 id="orgd1db7cd">The very basics</h2>
<div class="outline-text-2" id="text-orgd1db7cd">
<p>
Let's try to match the word "apple". <code>/apple/</code> would do the job. It, however, won't match "APPLE" or "aPpLe", because regex is case sensitive.
</p>

<p>
To disable case sensitivity in regex use what's called an <code>i</code> flag, like this <code>/apple/i</code>. Now it will match "apple", "APPLE" &amp; "aPpLe"
</p>

<p>
If you want to match two words in a single regex, use <code>/apple|nut/</code>.
</p>
</div>
<div id="outline-container-orgb7499a5" class="outline-3">
<h3 id="orgb7499a5">Usage in JavaScript</h3>
<div class="outline-text-3" id="text-orgb7499a5">
<p>
Take this as an introduction to the most basic methods in JS for working with regexes.
</p>
</div>
<div id="outline-container-org8b62591" class="outline-4">
<h4 id="org8b62591">str.match(regex)</h4>
<div class="outline-text-4" id="text-org8b62591">
<p>
returns an array with all the matches. However, there's a little catch here. If you try doing this:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-string">"apple apple"</span>.match(<span class="org-string">/apple/</span>)
</pre>
</div>
<p>
you'd probably expect to get <code>[ 'apple', 'apple' ]</code> but that's not the case. Without its <code>g</code> flag, regex won't match multiple occurrences. So in that case, <code>/apple/</code> matches just the first occurrence of the substring "apple" and <code>/apple/g</code> matches all of the occurrences. 
</p>
</div>
</div>
<div id="outline-container-org861268f" class="outline-4">
<h4 id="org861268f">regex.test(str)</h4>
<div class="outline-text-4" id="text-org861268f">
<p>
Think of <code>regex</code> as a variable holding a RegExp object and <code>str</code> is the string you test against <code>regex</code>. The method returns a boolean indicating whether it matched or not.
</p>

<p>
Let's play with all we've just learned:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">regex</span> = <span class="org-string">/code|easy/</span>i
<span class="linenr"> 2: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">"this code is EaSy super easy"</span>
<span class="linenr"> 3: </span>  regex.test(str) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; true; we've got a match!</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  str.match(regex) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "code", index: 5, input... ]</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Oops! We forgot adding the g flag</span>
<span class="linenr"> 8: </span>  regex = <span class="org-string">/code|easy/</span>ig
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  str.match(regex) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "code", "EaSy", "easy" ]</span>
<span class="linenr">11: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Alright!</span>
</pre>
</div>
</div>
</div>
</div>
</div>
