content/blog/webmaster_project/Regular Expressions Tutorial.org
* Flags
Flags are like settings to your regular expression that help you control its behavior. They're placed after the last slash of a regex literal or in a string as a second parameter of the RegExp constructor.

In JavaScript, we have 6 flags that affect the match
+ ~i~
  Makes the match case-insensitive, i.e. make no difference between "C" and "c".
+ ~g~
  Without this flag only the first match will be returned.
+ ~m~
  Multiline mode; only affects the behavior of ~^~ and ~$~ (more on these, later).
+ ~s~
  Dotall mode; Allows wildcard period ~.~ to match newline character ~\n~.
+ ~u~
  Enables full unicode support.
+ ~y~
  Sticky mode. Enables searching at a specific position.
* Match anything with wildcard period
Now that we've covered the very basics, let the real fun begin!

We've learned how to statically match a word like ~/hug/~. Now what if we want to match "hu​_h_", "hu​_b_", "hu​_g_", "hu​_m_" all with the same regular expression? Wildcard on help!
#+begin_src js -n
  /hu./
#+end_src
The above regular expression will match "hu<any character here>"
* Match a single character with multiple possibilities
The Wildcard period is way too loose in most cases and you need to match only a specific set of characters. That's when you need the ~[]~ construct to do something like this:
#+begin_src js -n
  /hu[hb]/
#+end_src
Which will match "hu​_h_", "hu​_b_" but not "hu​_g_" or "hu​_m_".
** More complex cases
#+begin_src js -n
  "abcdefghijklmnopqr".match(/[defghij]/g)
  // => [ "d", "e", "f", "g", "h", "i", "j" ]

  // Same as
  
  "abcdefghijklmnopqr".match(/[d-j]/g)
  // => [ "d", "e", "f", "g", "h", "i", "j" ]
#+end_src

  And

#+begin_src js -n
  "1234567890".match(/[456789]/g)
  // => [ "4", "5", "6", "7", "8", "9" ]

  // Same as

  "1234567890".match(/[4-9]/g)
  // => [ "4", "5", "6", "7", "8", "9" ]
#+end_src

You can also combine multiple rules like ~[A-Za-z0-9_]~.
** Common shorthands
+ Instead of ~[A-Za-z0-9]~, simply use ~\w~.
+ Instead of ~[^A-Za-z0-9]~, simply use ~\w~.
+ Instead of ~[0-9]~, simply use ~\d~.
+ Instead of ~[^0-9]~, simply use ~\D~.
+ Instead of ~[\r\t\f\n\v]~ (matches all kinds of whitespaces), simply use ~\s~.
+ Instead of ~[^\r\t\f\n\v]~, simply use ~\​S~.
** Reverse the character classes
~[a-z]~ will match all letters from a to z. To invert this selection and match all symbols *except* the ones specified, use ~[^a-z]~. Note that ~^~ character has a completely different behavior used outside of ~[]~.
* Match characters that occur one or more times
With the ~+~ character that matches one or more instances of the preceding element. Best show you an example:
 #+begin_src js -n
  const regex = /a+/g
  "abc".match(regex)    // => [ 'a' ]
  "aabc".match(regex)   // => [ 'aa' ]
  "aabac".match(regex) // => [ 'aa', 'a' ]
  "bbc".match(regex)    // => null

  const regex = /a/g
  "abc".match(regex)    // => [ 'a' ]
  "aabc".match(regex)   // => [ 'a', 'a' ]
  "aabac".match(regex) // => [ 'a', 'a', 'a' ]
  "bbc".match(regex)    // => null
#+end_src
* Look for patterns from the beginning or from the end of string
To search for a character from the beginning of a string, use ~^~.
#+begin_src js -n
  const regex = /^K/
  regex.test("__K_K_") // => false: K is not exactly in the beginning
  regex.test("K__K__") // => true: K is in the beginning
#+end_src

To search for a character from the end of a string, use ~$~.
#+begin_src js -n
  const regex = /K$/
  regex.test("__K_K_") // => false: K is not exactly in the end
  regex.test("__K") // => true: K is in the end
#+end_src
* Optional Character
#+begin_src js -n
  const regex = /colou?r/ // Makes "u" optional

  const american = "color"
  const british = "colour"

  regex.test(american) // => true
  regex.test(british)  // => true
  regex.test("cologr") // => false
#+end_src
