public/blog/webmaster_project/Regular Expressions Tutorial.html
<div id="outline-container-orgca900ff" class="outline-2">
<h2 id="orgca900ff">Flags</h2>
<div class="outline-text-2" id="text-orgca900ff">
<p>
Flags are like settings to your regular expression that help you control its behavior. They're placed after the last slash of a regex literal or in a string as a second parameter of the RegExp constructor.
</p>

<p>
In JavaScript, we have 6 flags that affect the match
</p>
<ul class="org-ul">
<li><code>i</code>
Makes the match case-insensitive, i.e. make no difference between "C" and "c".</li>
<li><code>g</code>
Without this flag only the first match will be returned.</li>
<li><code>m</code>
Multiline mode; only affects the behavior of <code>^</code> and <code>$</code> (more on these, later).</li>
<li><code>s</code>
Dotall mode; Allows wildcard period <code>.</code> to match newline character <code>\n</code>.</li>
<li><code>u</code>
Enables full unicode support.</li>
<li><code>y</code>
Sticky mode. Enables searching at a specific position.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcbde880" class="outline-2">
<h2 id="orgcbde880">Match anything with wildcard period</h2>
<div class="outline-text-2" id="text-orgcbde880">
<p>
Now that we've covered the very basics, let the real fun begin!
</p>

<p>
We've learned how to statically match a word like <code>/hug/</code>. Now what if we want to match "hu​<span class="underline">h</span>", "hu​<span class="underline">b</span>", "hu​<span class="underline">g</span>", "hu​<span class="underline">m</span>" all with the same regular expression? Wildcard on help!
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-string">/hu./</span>
</pre>
</div>
<p>
The above regular expression will match "hu&lt;any character here&gt;"
</p>
</div>
</div>
<div id="outline-container-orgc0b8f52" class="outline-2">
<h2 id="orgc0b8f52">Match a single character with multiple possibilities</h2>
<div class="outline-text-2" id="text-orgc0b8f52">
<p>
The Wildcard period is way too loose in most cases and you need to match only a specific set of characters. That's when you need the <code>[]</code> construct to do something like this:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-string">/hu[hb]/</span>
</pre>
</div>
<p>
Which will match "hu​<span class="underline">h</span>", "hu​<span class="underline">b</span>" but not "hu​<span class="underline">g</span>" or "hu​<span class="underline">m</span>".
</p>
</div>
<div id="outline-container-org554e59f" class="outline-3">
<h3 id="org554e59f">More complex cases</h3>
<div class="outline-text-3" id="text-org554e59f">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-string">"abcdefghijklmnopqr"</span>.match(<span class="org-string">/[defghij]/</span>g)
<span class="linenr">2: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "d", "e", "f", "g", "h", "i", "j" ]</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Same as</span>
<span class="linenr">5: </span>  
<span class="linenr">6: </span>  <span class="org-string">"abcdefghijklmnopqr"</span>.match(<span class="org-string">/[d-j]/</span>g)
<span class="linenr">7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "d", "e", "f", "g", "h", "i", "j" ]</span>
</pre>
</div>

<p>
And
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-string">"1234567890"</span>.match(<span class="org-string">/[456789]/</span>g)
<span class="linenr">2: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "4", "5", "6", "7", "8", "9" ]</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Same as</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span>  <span class="org-string">"1234567890"</span>.match(<span class="org-string">/[4-9]/</span>g)
<span class="linenr">7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "4", "5", "6", "7", "8", "9" ]</span>
</pre>
</div>

<p>
You can also combine multiple rules like <code>[A-Za-z0-9_]</code>.
</p>
</div>
</div>
<div id="outline-container-org85cc0b6" class="outline-3">
<h3 id="org85cc0b6">Common shorthands</h3>
<div class="outline-text-3" id="text-org85cc0b6">
<ul class="org-ul">
<li>Instead of <code>[A-Za-z0-9]</code>, simply use <code>\w</code>.</li>
<li>Instead of <code>[^A-Za-z0-9]</code>, simply use <code>\w</code>.</li>
<li>Instead of <code>[0-9]</code>, simply use <code>\d</code>.</li>
<li>Instead of <code>[^0-9]</code>, simply use <code>\D</code>.</li>
<li>Instead of <code>[\r\t\f\n\v]</code> (matches all kinds of whitespaces), simply use <code>\s</code>.</li>
<li>Instead of <code>[^\r\t\f\n\v]</code>, simply use <code>\​S</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org33593d6" class="outline-3">
<h3 id="org33593d6">Reverse the character classes</h3>
<div class="outline-text-3" id="text-org33593d6">
<p>
<code>[a-z]</code> will match all letters from a to z. To invert this selection and match all symbols <b>except</b> the ones specified, use <code>[^a-z]</code>. Note that <code>^</code> character has a completely different behavior used outside of <code>[]</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbc858de" class="outline-2">
<h2 id="orgbc858de">Match characters that occur one or more times</h2>
<div class="outline-text-2" id="text-orgbc858de">
<p>
With the <code>+</code> character that matches one or more instances of the preceding element. Best show you an example:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/a+/</span>g
<span class="linenr"> 2: </span>  <span class="org-string">"abc"</span>.match(regex)    <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ 'a' ]</span>
<span class="linenr"> 3: </span>  <span class="org-string">"aabc"</span>.match(regex)   <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ 'aa' ]</span>
<span class="linenr"> 4: </span>  <span class="org-string">"aabac"</span>.match(regex) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ 'aa', 'a' ]</span>
<span class="linenr"> 5: </span>  <span class="org-string">"bbc"</span>.match(regex)    <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; null</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/a/</span>g
<span class="linenr"> 8: </span>  <span class="org-string">"abc"</span>.match(regex)    <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ 'a' ]</span>
<span class="linenr"> 9: </span>  <span class="org-string">"aabc"</span>.match(regex)   <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ 'a', 'a' ]</span>
<span class="linenr">10: </span>  <span class="org-string">"aabac"</span>.match(regex) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ 'a', 'a', 'a' ]</span>
<span class="linenr">11: </span>  <span class="org-string">"bbc"</span>.match(regex)    <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; null</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f37b47" class="outline-2">
<h2 id="org4f37b47">Look for patterns from the beginning or from the end of string</h2>
<div class="outline-text-2" id="text-org4f37b47">
<p>
To search for a character from the beginning of a string, use <code>^</code>.
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/^K/</span>
<span class="linenr">2: </span>  regex.test(<span class="org-string">"__K_K_"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; false: K is not exactly in the beginning</span>
<span class="linenr">3: </span>  regex.test(<span class="org-string">"K__K__"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; true: K is in the beginning</span>
</pre>
</div>

<p>
To search for a character from the end of a string, use <code>$</code>.
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/K$/</span>
<span class="linenr">2: </span>  regex.test(<span class="org-string">"__K_K_"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; false: K is not exactly in the end</span>
<span class="linenr">3: </span>  regex.test(<span class="org-string">"__K"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; true: K is in the end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef26054" class="outline-2">
<h2 id="orgef26054">Optional Character</h2>
<div class="outline-text-2" id="text-orgef26054">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">regex</span> = <span class="org-string">/colou?r/</span> <span class="org-comment-delimiter">// </span><span class="org-comment">Makes "u" optional</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">american</span> = <span class="org-string">"color"</span>
<span class="linenr">4: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">british</span> = <span class="org-string">"colour"</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span>  regex.test(american) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; true</span>
<span class="linenr">7: </span>  regex.test(british)  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; true</span>
<span class="linenr">8: </span>  regex.test(<span class="org-string">"cologr"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; false</span>
</pre>
</div>
</div>
</div>
