content/blog/webmaster_project/Regular Expressions Tutorial.org
* Specify upper and lower limit of matches
What if you want to match a sequence of characters that repeats X times? ~/a{5}/~ would do the trick!
#+begin_src js -n
  const str = "ama baalo maaaaamal aaaaa"
  console.log( str.match( /a{5}/g ) ) // => [ "aaaaa", "aaaaa" ]
#+end_src
To match "m" letter followed by 5 times "a": ~/ma{5}/~. To match an empty space followed by 4 times "a": ~/\sa{4}/~.

Now, what if you want to match from *m* to *p* repeating characters? ~/a{1,3}/~ applied to ~str~ (from the last example) would match "a", "aa" and "aaa". If any of *m* or *p* needs to be infinity (/[1, ∞]/ or /[∞, 3]/) we can omit an argument, respectively like ~/a{1,}/~ or ~/a{,3}/~.
* Match characters that occur multiple times
** Match *one or more* characters
~+~ after the target character
#+begin_src js -n
  const str = "ama baalo maaaaamal"

  console.log( str.match( /a+/g ) )
  // => ["a", "a", "aa", "aaaaa", "a"]

  console.log( str.match( /a/g ) )
  // => [ "a", "a", "a", "a", "a", "a", "a", "a", "a", "a" ]
#+end_src
** Match *zero or more* characters
~*~ after the target character
#+begin_src js -n
  const str = "aaa"

  console.log( str.match( /a*/g ) )
  // => ["aaa", ""]

  console.log( str.match( /a/g ) )
  // => ["a", "a", "a"]
#+end_src
** Match *zero or one* character
~?~ after the target character
#+begin_src js -n
  const str = "aaa"
  console.log( str.match( /a?/g ) )
  // => ["a", "a", "a", ""]
#+end_src
* Positive and negative lookahead
This is considered to be one of the abstract topics in regex, but I will try to cover 80/100 of what you need to know.

 + ~a(?=g)~ - Positive LookAhead. Matches all "a" that are *followed* by "g", without making the "g" part of the match.

 + ~a(?!g)~ - Negative LookAhead. Matches all "a" that are *not followed* by "g", without making "g" part of the match.

Positive/Negative LookAhead is a powerful feature. consider this: ~(?=regex)~ or ~(?!regex)~. You can replace regex with any valid regular expression!

Let's play with it a little;
#+begin_src js -n
  const str = "IsFunBaloonIsLearningRegExIsLean"

  // Matches the 2nd "Is", right before "Learning"
  console.log( str.match( /Is(?=Learning)/ ) )
  // => [ "Is", index: 11, ... ]

  // Matches the 3rd "Is", right before "Lean"
  console.log( str.match( /Is(?=Lean)/ ) )
  // => [ "Is", index: 26, ... ]

  // Matches all "Is" that are followed by "L"
  console.log( str.match( /Is(?=L)/g ) )
  // => [ "Is", "Is" ]

  // Match all "Is" that aren't followed by "L"
  console.log( str.match( /Is(?!L)/ ) )
  // => [ "Is", index: 0, ... ]
#+end_src
* Reusing patterns with *Capture Groups*
We all know and should obey the DRY principle. Capture groups help us do exactly this. No better way to explain it than a few good examples:
** First example
~/(bamm+)\w\1/g~ same as

~/(bamm+)\w(bamm+)/g~ same as

~/bamm+\wbamm+/g~
** Second example
~/(\w+)\s(\1\1\1)\2/g~ same as

~/(\w+)\s\1\1\1\1\1\1/g~
** Third example
~/(\w+)\s\1\1\1/g~ same as

~/\w+\s\w+\w+\w+/g~
* All 8 JavaScript methods which use regex
** *str*.match(*regex*)
Finds all matches of *regex* in the string *str* and returns an array of those matches.
** *regex*.exec(*str*)
Similar to the ~.match()~ method but it's meant to be used in a loop when the *regex* is stored in a global variable but not passed directly.
#+begin_src js -n
  let re = /bla/g
  let str = 'bla and yeah bla yeh'

  re.exec(str) // => ["bla", index: 0, ...]
  re.exec(str) // => ["bla", index: 13, ...]
  re.exec(str) // => null
  re.exec(str) // => ["bla", index: 0, ...]: Starts again.
#+end_src
Usage with a loop:
#+begin_src js -n
  let match, str = 'bla and yeah bla yeh ble'
  while (match = re.exec(str)) {
    console.log(match)
  }
  // => ["bla", index: 0, input: ...]
  // => ["bla", index: 13, input: ...]
#+end_src
~.match()~ compared to ~.exec()~ is pretty simple:
#+begin_src js -n
  str.match(re)
  // => ["bla", "bla"]
#+end_src
