public/blog/webmaster_project/Regular Expressions Tutorial.html
<div id="outline-container-org26a2b62" class="outline-2">
<h2 id="org26a2b62">Specify upper and lower limit of matches</h2>
<div class="outline-text-2" id="text-org26a2b62">
<p>
What if you want to match a sequence of characters that repeats X times? <code>/a{5}/</code> would do the trick!
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">"ama baalo maaaaamal aaaaa"</span>
<span class="linenr">2: </span>  console.log( str.match( <span class="org-string">/a{5}/</span>g ) ) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "aaaaa", "aaaaa" ]</span>
</pre>
</div>
<p>
To match "m" letter followed by 5 times "a": <code>/ma{5}/</code>. To match an empty space followed by 4 times "a": <code>/\sa{4}/</code>.
</p>

<p>
Now, what if you want to match from <b>m</b> to <b>p</b> repeating characters? <code>/a{1,3}/</code> applied to <code>str</code> (from the last example) would match "a", "aa" and "aaa". If any of <b>m</b> or <b>p</b> needs to be infinity (<i>[1, ∞]</i> or <i>[∞, 3]</i>) we can omit an argument, respectively like <code>/a{1,}/</code> or <code>/a{,3}/</code>.
</p>
</div>
</div>
<div id="outline-container-orgc8ca0dd" class="outline-2">
<h2 id="orgc8ca0dd">Match characters that occur multiple times</h2>
<div class="outline-text-2" id="text-orgc8ca0dd">
</div>
<div id="outline-container-org4b5dd5d" class="outline-3">
<h3 id="org4b5dd5d">Match <b>one or more</b> characters</h3>
<div class="outline-text-3" id="text-org4b5dd5d">
<p>
<code>+</code> after the target character
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">"ama baalo maaaaamal"</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>  console.log( str.match( <span class="org-string">/a+/</span>g ) )
<span class="linenr">4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["a", "a", "aa", "aaaaa", "a"]</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span>  console.log( str.match( <span class="org-string">/a/</span>g ) )
<span class="linenr">7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "a", "a", "a", "a", "a", "a", "a", "a", "a", "a" ]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org856c378" class="outline-3">
<h3 id="org856c378">Match <b>zero or more</b> characters</h3>
<div class="outline-text-3" id="text-org856c378">
<p>
<code>*</code> after the target character
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">"aaa"</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>  console.log( str.match( <span class="org-string">/a*/</span>g ) )
<span class="linenr">4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["aaa", ""]</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span>  console.log( str.match( <span class="org-string">/a/</span>g ) )
<span class="linenr">7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["a", "a", "a"]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3eda6fa" class="outline-3">
<h3 id="org3eda6fa">Match <b>zero or one</b> character</h3>
<div class="outline-text-3" id="text-org3eda6fa">
<p>
<code>?</code> after the target character
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">"aaa"</span>
<span class="linenr">2: </span>  console.log( str.match( <span class="org-string">/a?/</span>g ) )
<span class="linenr">3: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["a", "a", "a", ""]</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfac878d" class="outline-2">
<h2 id="orgfac878d">Positive and negative lookahead</h2>
<div class="outline-text-2" id="text-orgfac878d">
<p>
This is considered to be one of the abstract topics in regex, but I will try to cover 80/100 of what you need to know.
</p>

<ul class="org-ul">
<li><code>a(?=g)</code> - Positive LookAhead. Matches all "a" that are <b>followed</b> by "g", without making the "g" part of the match.</li>

<li><code>a(?!g)</code> - Negative LookAhead. Matches all "a" that are <b>not followed</b> by "g", without making "g" part of the match.</li>
</ul>

<p>
Positive/Negative LookAhead is a powerful feature. consider this: <code>(?=regex)</code> or <code>(?!regex)</code>. You can replace regex with any valid regular expression!
</p>

<p>
Let's play with it a little;
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">str</span> = <span class="org-string">"IsFunBaloonIsLearningRegExIsLean"</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Matches the 2nd "Is", right before "Learning"</span>
<span class="linenr"> 4: </span>  console.log( str.match( <span class="org-string">/Is(?=Learning)/</span> ) )
<span class="linenr"> 5: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "Is", index: 11, ... ]</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Matches the 3rd "Is", right before "Lean"</span>
<span class="linenr"> 8: </span>  console.log( str.match( <span class="org-string">/Is(?=Lean)/</span> ) )
<span class="linenr"> 9: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "Is", index: 26, ... ]</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Matches all "Is" that are followed by "L"</span>
<span class="linenr">12: </span>  console.log( str.match( <span class="org-string">/Is(?=L)/</span>g ) )
<span class="linenr">13: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "Is", "Is" ]</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Match all "Is" that aren't followed by "L"</span>
<span class="linenr">16: </span>  console.log( str.match( <span class="org-string">/Is(?!L)/</span> ) )
<span class="linenr">17: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; [ "Is", index: 0, ... ]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd969263" class="outline-2">
<h2 id="orgd969263">Reusing patterns with <b>Capture Groups</b></h2>
<div class="outline-text-2" id="text-orgd969263">
<p>
We all know and should obey the DRY principle. Capture groups help us do exactly this. No better way to explain it than a few good examples:
</p>
</div>
<div id="outline-container-org5f187bf" class="outline-3">
<h3 id="org5f187bf">First example</h3>
<div class="outline-text-3" id="text-org5f187bf">
<p>
<code>/(bamm+)\w\1/g</code> same as
</p>

<p>
<code>/(bamm+)\w(bamm+)/g</code> same as
</p>

<p>
<code>/bamm+\wbamm+/g</code>
</p>
</div>
</div>
<div id="outline-container-org619bb14" class="outline-3">
<h3 id="org619bb14">Second example</h3>
<div class="outline-text-3" id="text-org619bb14">
<p>
<code>/(\w+)\s(\1\1\1)\2/g</code> same as
</p>

<p>
<code>/(\w+)\s\1\1\1\1\1\1/g</code>
</p>
</div>
</div>
<div id="outline-container-orgfa4837c" class="outline-3">
<h3 id="orgfa4837c">Third example</h3>
<div class="outline-text-3" id="text-orgfa4837c">
<p>
<code>/(\w+)\s\1\1\1/g</code> same as
</p>

<p>
<code>/\w+\s\w+\w+\w+/g</code>
</p>
</div>
</div>
</div>
<div id="outline-container-org4700741" class="outline-2">
<h2 id="org4700741">All 8 JavaScript methods which use regex</h2>
<div class="outline-text-2" id="text-org4700741">
</div>
<div id="outline-container-org0408a27" class="outline-3">
<h3 id="org0408a27"><b>str</b>.match(<b>regex</b>)</h3>
<div class="outline-text-3" id="text-org0408a27">
<p>
Finds all matches of <b>regex</b> in the string <b>str</b> and returns an array of those matches.
</p>
</div>
</div>
<div id="outline-container-orgce0ddbd" class="outline-3">
<h3 id="orgce0ddbd"><b>regex</b>.exec(<b>str</b>)</h3>
<div class="outline-text-3" id="text-orgce0ddbd">
<p>
Similar to the <code>.match()</code> method but it's meant to be used in a loop when the <b>regex</b> is stored in a global variable but not passed directly.
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">re</span> = <span class="org-string">/bla/</span>g
<span class="linenr">2: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">str</span> = <span class="org-string">'bla and yeah bla yeh'</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>  re.exec(str) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 0, ...]</span>
<span class="linenr">5: </span>  re.exec(str) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 13, ...]</span>
<span class="linenr">6: </span>  re.exec(str) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; null</span>
<span class="linenr">7: </span>  re.exec(str) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 0, ...]: Starts again.</span>
</pre>
</div>
<p>
Usage with a loop:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">match</span>, <span class="org-variable-name">str</span> = <span class="org-string">'bla and yeah bla yeh ble'</span>
<span class="linenr">2: </span>  <span class="org-keyword">while</span> (match = re.exec(str)) {
<span class="linenr">3: </span>    console.log(match)
<span class="linenr">4: </span>  }
<span class="linenr">5: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 0, input: ...]</span>
<span class="linenr">6: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 13, input: ...]</span>
</pre>
</div>
<p>
<code>.match()</code> compared to <code>.exec()</code> is pretty simple:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  str.match(re)
<span class="linenr">2: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", "bla"]</span>
</pre>
</div>
</div>
</div>
