content/blog/webmaster_project/Regular Expressions Tutorial.org
** *str*.matchAll(*regex*)
An improvement over the previously covered ~.match()~ method, ~matchAll()~ was introduced in ES2020

~.matchAll()~ is introduced in ES2020 and it is an improvement on the ~.match()~ method. There are three differences between the two:
1. ~.matchAll()~ returns an iterable object with matches instead of an array.
2. Each match is in the same format as ~str.match()~ without the 'g' flag.
3. If there are no matches, it returns an empty iterable object, rather than null if you used ~.match()~
I think this method is most usable when a 'g' flag is added to the *regex*.
#+begin_src js -n
  let regexp = /bla/g
  let str = 'bla and yeah bla yeh'
  const matches = str.matchAll(regexp)
  for (let match of matches) {
    console.log(match)
  }
  // => ["bla", index: 0, ...]
  // => ["bla", index: 13, ...]
#+end_src
** *regex*.test(*str*)
Looks for at least one match of *regex* in *str*. If found, returns true. Otherwise, false.
** *str*.search(*regex*)
Returns the index of the first available match. If no match is found, it returns -1.
** *str*.split(*separator*)
Instead of passing a simple string to *separator* like '' (in the most frequent case), we can also pass regex for more precise split.
** *str*.replace(*from*, to)
*from* is what to match. It can be a string or regex. The first match will be replaced with the string you have passed to the *to* argument. Instead of a string, you can pass a function too.

If you add a 'g' flag to the regex, ~.replace()~ starts working like the next and final method: 
** *str*.replaceAll(*from*, to)
Same as ~.replace()~, except that instead of replacing only the first match, it will replace all matches with the provided *to*.

A comparison between the last two:
#+begin_src js -n
  let str = "stuffed str living fforever pff"
  let regex = /f+/ // Match one or more 'f'

  str.replace(regex, '*') // => 'stu*ed str living fforever pff'
  str.replaceAll(regex, '*') // => 'stu*ed str living *orever p*'
#+end_src
* Closing words
Congratulations! Now you have the understanding to start using regular expressions in your practice.

Please, ask your questions and leave your suggestions down in the comments. They'll help me understand where my explanation is lacking and therefore improve it. Know that this is a dynamic article: One changing over time in dependence on the feedback I get. Let us together make this the best introduction to regular expressions available on the web!

** Contributors
:PROPERTIES:
:CUSTOM_ID: contributors_table
:END:
No contribution is left unnoticed. The people who helped this article evolve into what it is today are listed here:
+ thewebmasterp

