public/blog/webmaster_project/Regular Expressions Tutorial.html
<div id="outline-container-org19cc1ce" class="outline-3">
<h3 id="org19cc1ce"><b>str</b>.matchAll(<b>regex</b>)</h3>
<div class="outline-text-3" id="text-org19cc1ce">
<p>
An improvement over the previously covered <code>.match()</code> method, <code>matchAll()</code> was introduced in ES2020
</p>

<p>
<code>.matchAll()</code> is introduced in ES2020 and it is an improvement on the <code>.match()</code> method. There are three differences between the two:
</p>
<ol class="org-ol">
<li><code>.matchAll()</code> returns an iterable object with matches instead of an array.</li>
<li>Each match is in the same format as <code>str.match()</code> without the 'g' flag.</li>
<li>If there are no matches, it returns an empty iterable object, rather than null if you used <code>.match()</code></li>
</ol>
<p>
I think this method is most usable when a 'g' flag is added to the <b>regex</b>.
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">regexp</span> = <span class="org-string">/bla/</span>g
<span class="linenr">2: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">str</span> = <span class="org-string">'bla and yeah bla yeh'</span>
<span class="linenr">3: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">matches</span> = str.matchAll(regexp)
<span class="linenr">4: </span>  <span class="org-keyword">for</span> (<span class="org-keyword">let</span> <span class="org-variable-name">match</span> <span class="org-keyword">of</span> matches) {
<span class="linenr">5: </span>    console.log(match)
<span class="linenr">6: </span>  }
<span class="linenr">7: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 0, ...]</span>
<span class="linenr">8: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; ["bla", index: 13, ...]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge530817" class="outline-3">
<h3 id="orge530817"><b>regex</b>.test(<b>str</b>)</h3>
<div class="outline-text-3" id="text-orge530817">
<p>
Looks for at least one match of <b>regex</b> in <b>str</b>. If found, returns true. Otherwise, false.
</p>
</div>
</div>
<div id="outline-container-org113fffc" class="outline-3">
<h3 id="org113fffc"><b>str</b>.search(<b>regex</b>)</h3>
<div class="outline-text-3" id="text-org113fffc">
<p>
Returns the index of the first available match. If no match is found, it returns -1.
</p>
</div>
</div>
<div id="outline-container-orgb6720b6" class="outline-3">
<h3 id="orgb6720b6"><b>str</b>.split(<b>separator</b>)</h3>
<div class="outline-text-3" id="text-orgb6720b6">
<p>
Instead of passing a simple string to <b>separator</b> like '' (in the most frequent case), we can also pass regex for more precise split.
</p>
</div>
</div>
<div id="outline-container-org837942c" class="outline-3">
<h3 id="org837942c"><b>str</b>.replace(<b>from</b>, to)</h3>
<div class="outline-text-3" id="text-org837942c">
<p>
<b>from</b> is what to match. It can be a string or regex. The first match will be replaced with the string you have passed to the <b>to</b> argument. Instead of a string, you can pass a function too.
</p>

<p>
If you add a 'g' flag to the regex, <code>.replace()</code> starts working like the next and final method: 
</p>
</div>
</div>
<div id="outline-container-orgdbefc3d" class="outline-3">
<h3 id="orgdbefc3d"><b>str</b>.replaceAll(<b>from</b>, to)</h3>
<div class="outline-text-3" id="text-orgdbefc3d">
<p>
Same as <code>.replace()</code>, except that instead of replacing only the first match, it will replace all matches with the provided <b>to</b>.
</p>

<p>
A comparison between the last two:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">str</span> = <span class="org-string">"stuffed str living fforever pff"</span>
<span class="linenr">2: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">regex</span> = <span class="org-string">/f+/</span> <span class="org-comment-delimiter">// </span><span class="org-comment">Match one or more 'f'</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>  str.replace(regex, <span class="org-string">'*'</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; 'stu*ed str living fforever pff'</span>
<span class="linenr">5: </span>  str.replaceAll(regex, <span class="org-string">'*'</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; 'stu*ed str living *orever p*'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org60bebc5" class="outline-2">
<h2 id="org60bebc5">Closing words</h2>
<div class="outline-text-2" id="text-org60bebc5">
<p>
Congratulations! Now you have the understanding to start using regular expressions in your practice.
</p>

<p>
Please, ask your questions and leave your suggestions down in the comments. They'll help me understand where my explanation is lacking and therefore improve it. Know that this is a dynamic article: One changing over time in dependence on the feedback I get. Let us together make this the best introduction to regular expressions available on the web!
</p>
</div>

<div id="outline-container-contributors_table" class="outline-3">
<h3 id="contributors_table">Contributors</h3>
<div class="outline-text-3" id="text-contributors_table">
<p>
No contribution is left unnoticed. The people who helped this article evolve into what it is today are listed here:
</p>
<ul class="org-ul">
<li>thewebmasterp</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='remark42'></div>
   <script>
   	 var remark_config = {
	 	host: 'https://remark42.thewebmasterp.com',
	 	site_id: 'remark42.thewebmasterp.com',
	 }
   </script>
   <script>!function(e,n){for(var o=0;o<e.length;o++){var r=n.createElement('script'),c='.js',d=n.head||n.body;'noModule'in r?(r.type='module',c='.mjs'):r.async=!0,r.defer=!0,r.src=remark_config.host+'/web/'+e[o]+c,d.appendChild(r)}}(remark_config.components||['embed'],document);</script>
   <xml>
     <socmedia>
       <entry>
         <label>Github</label>
         <href>https://github.com/thewebmasterp</href>
         <icon>github.svg</icon>
       </entry>
       <entry>
         <label>Instagram</label>
         <href>https://www.instagram.com/webmaster_project</href>
         <icon>instagram.svg</icon>
       </entry>
       <entry>
         <label>Twitter</label>
         <href>https://twitter.com/thewebmasterp</href>
         <icon>twitter.svg</icon>
       </entry>
       <entry>
         <label>Codepen</label>
         <href>https://codepen.io/thewebmasterp</href>
         <icon>codepen.svg</icon>
       </entry>
       <entry>
         <label>Blog RSS Feed</label>
         <href>/blog.xml</href>
         <icon>rss.svg</icon>
       </entry>
     </socmedia>
     <subscribe>
       <cta></cta>
     </subscribe>
     <info>
     </info>
   </xml>
</div>
</body>
</html>
